ESP32Async/AsyncTCP/src/AsyncTCP.cpp
// SPDX-License-Identifier: LGPL-3.0-or-later
// Copyright 2016-2025 Hristo Gochkov, Mathieu Carbou, Emil Muratov

#include "Arduino.h"

#include "AsyncTCP.h"
#include "simple_intrusive_list.h"

extern "C" {
#include "lwip/dns.h"
#include "lwip/err.h"
#include "lwip/inet.h"
#include "lwip/opt.h"
#include "lwip/tcp.h"
#include "lwip/tcpip.h"
#include "lwip/sys.h"
}

#if CONFIG_ASYNC_TCP_USE_WDT
#include "esp_task_wdt.h"
#define ASYNC_TCP_MAX_TASK_SLEEP (pdMS_TO_TICKS(1000 * CONFIG_ESP_TASK_WDT_TIMEOUT_S) / 4)
#else
#define ASYNC_TCP_MAX_TASK_SLEEP portMAX_DELAY
#endif

// Required for:
// https://github.com/espressif/arduino-esp32/blob/3.0.3/libraries/Network/src/NetworkInterface.cpp#L37-L47
#if ESP_IDF_VERSION_MAJOR >= 5
#include <NetworkInterface.h>
#endif

// https://github.com/espressif/arduino-esp32/issues/10526
namespace {
#ifdef CONFIG_LWIP_TCPIP_CORE_LOCKING
struct tcp_core_guard {
  bool do_lock;
  inline tcp_core_guard() : do_lock(!sys_thread_tcpip(LWIP_CORE_LOCK_QUERY_HOLDER)) {
    if (do_lock) {
      LOCK_TCPIP_CORE();
    }
  }
  inline ~tcp_core_guard() {
    if (do_lock) {
      UNLOCK_TCPIP_CORE();
    }
  }
  tcp_core_guard(const tcp_core_guard &) = delete;
  tcp_core_guard(tcp_core_guard &&) = delete;
  tcp_core_guard &operator=(const tcp_core_guard &) = delete;
  tcp_core_guard &operator=(tcp_core_guard &&) = delete;
};
#else   // CONFIG_LWIP_TCPIP_CORE_LOCKING
struct tcp_core_guard {};
#endif  // CONFIG_LWIP_TCPIP_CORE_LOCKING
}  // anonymous namespace

/*
  TCP poll interval is specified in terms of the TCP coarse timer interval, which is called twice a second
  https://github.com/espressif/esp-lwip/blob/2acf959a2bb559313cd2bf9306c24612ba3d0e19/src/core/tcp.c#L1895
*/
#define CONFIG_ASYNC_TCP_POLL_TIMER 1

#ifdef ASYNC_TCP_DEBUG
#define DEBUG_PRINTF(...) log_d(__VA_ARGS__)
#else
#define DEBUG_PRINTF(...)
#endif

/*
 * TCP/IP Event Task
 * */

typedef enum {
  LWIP_TCP_SENT,
  LWIP_TCP_RECV,
  LWIP_TCP_FIN,
  LWIP_TCP_ERROR,
  LWIP_TCP_POLL,
  LWIP_TCP_CLEAR,
  LWIP_TCP_ACCEPT,
  LWIP_TCP_CONNECTED,
  LWIP_TCP_DNS
} lwip_tcp_event_t;

struct lwip_tcp_event_packet_t {
  lwip_tcp_event_packet_t *next;
  lwip_tcp_event_t event;
  AsyncClient *client;
#ifdef ASYNCTCP_VALIDATE_PCB
  tcp_pcb *pcb;
#endif
  union {
    struct {
      int8_t err;
    } connected;
    struct {
      int8_t err;
    } error;
    struct {
      pbuf *pb;
      int8_t err;
    } recv;
    struct {
      int8_t err;
    } fin;
    struct {
      AsyncServer *server;
    } accept;
    struct {
      const char *name;
      ip_addr_t addr;
    } dns;
  };
};

// Detail class for interacting with AsyncClient internals, but without exposing the API to other parts of the program
class AsyncClient_detail {
public:
  static inline lwip_tcp_event_packet_t *invalidate_pcb(AsyncClient &client);
  static inline lwip_tcp_event_packet_t *get_async_event();
  static void __attribute__((visibility("internal"))) handle_async_event(lwip_tcp_event_packet_t *event);

  // TCP event callbacks
  static int8_t __attribute__((visibility("internal"))) tcp_recv(void *arg, struct tcp_pcb *pcb, struct pbuf *pb, int8_t err);
  static int8_t __attribute__((visibility("internal"))) tcp_sent(void *arg, struct tcp_pcb *pcb, uint16_t len);
  static void __attribute__((visibility("internal"))) tcp_error(void *arg, int8_t err);
  static int8_t __attribute__((visibility("internal"))) tcp_poll(void *arg, struct tcp_pcb *pcb);
};

// helper function
static lwip_tcp_event_packet_t *_alloc_event(lwip_tcp_event_t event, AsyncClient *client, tcp_pcb *pcb) {
  // Validation check
  if (pcb && (client->pcb() != pcb)) {
    // Client structure is corrupt?
    log_e("Client mismatch allocating event for 0x%08x 0x%08x vs 0x%08x", (intptr_t)client, (intptr_t)pcb, client->pcb());
    tcp_abort(pcb);
    AsyncClient_detail::tcp_error(client, ERR_ARG);
    return nullptr;
  }

  auto *e = new (std::nothrow) lwip_tcp_event_packet_t{nullptr, event, client};

  if (!e) {
    // Allocation fail - abort client and give up
    log_e("OOM allocating event for 0x%08x 0x%08x", (intptr_t)client, (intptr_t)pcb);
    if (pcb) {
      tcp_abort(pcb);
    }
    AsyncClient_detail::tcp_error(client, ERR_MEM);
    return nullptr;
  }

#ifdef ASYNCTCP_VALIDATE_PCB
  e->pcb = pcb;
#endif
  DEBUG_PRINTF("_AE: 0x%08x -> %d 0x%08x 0x%08x", (intptr_t)e, (int)event, (intptr_t)client, (intptr_t)pcb);
  return e;
}

static void _free_event(lwip_tcp_event_packet_t *evpkt) {
  DEBUG_PRINTF("_FE: 0x%08x -> %d 0x%08x [0x%08x]", (intptr_t)evpkt, (int)evpkt->event, (intptr_t)evpkt->client, (intptr_t)evpkt->next);
  if ((evpkt->event == LWIP_TCP_RECV) && (evpkt->recv.pb != nullptr)) {
    pbuf_free(evpkt->recv.pb);
  }
  delete evpkt;
}

// Global variables
static simple_intrusive_list<lwip_tcp_event_packet_t> _async_queue;
static TaskHandle_t _async_service_task_handle = NULL;

namespace {
#if defined(CONFIG_LWIP_TCPIP_CORE_LOCKING) && defined(CONFIG_ASYNC_TCP_QUEUE_LWIP_LOCK)
typedef tcp_core_guard queue_mutex_guard;
#else
class queue_mutex_guard {

  // Create-on-first-use idiom for an embedded mutex
  static SemaphoreHandle_t _async_queue_mutex() {

    static SemaphoreHandle_t mutex = xSemaphoreCreateMutex();
    assert(mutex != nullptr);
    return mutex;
  };

  bool holds_mutex;

public:
  inline queue_mutex_guard() : holds_mutex(xSemaphoreTake(_async_queue_mutex(), portMAX_DELAY)){};
  inline ~queue_mutex_guard() {
    if (holds_mutex) {
      xSemaphoreGive(_async_queue_mutex());
    }
  };
  inline explicit operator bool() const {
    return holds_mutex;
  };
};
#endif
}  // namespace

static inline bool _init_async_event_queue() {
  return true;
}

static inline void _send_async_event(lwip_tcp_event_packet_t *e) {
  assert(e != nullptr);
  _async_queue.push_back(e);
#ifdef ASYNC_TCP_DEBUG
  uint32_t n;
  xTaskNotifyAndQuery(_async_service_task_handle, 1, eIncrement, &n);
  DEBUG_PRINTF("0x%08x", (intptr_t)e);
#else
  xTaskNotifyGive(_async_service_task_handle);
#endif
}

static inline void _prepend_async_event(lwip_tcp_event_packet_t *e) {
  assert(e != nullptr);
  _async_queue.push_front(e);

