ESP32Async/AsyncTCP/src/AsyncTCP.cpp
#ifdef ASYNC_TCP_DEBUG
  uint32_t n;
  xTaskNotifyAndQuery(_async_service_task_handle, 1, eIncrement, &n);
  DEBUG_PRINTF("0x%08x", (intptr_t)e);
#else
  xTaskNotifyGive(_async_service_task_handle);
#endif
}

static void _remove_events_for(AsyncClient *client) {
#ifdef ASYNC_TCP_DEBUG
  auto start_length = _async_queue.size();
#endif

  auto removed_event_chain = _async_queue.remove_if([=](lwip_tcp_event_packet_t &pkt) {
    return pkt.client == client;
  });

  size_t count = 0;
  while (removed_event_chain) {
    ++count;
    auto t = removed_event_chain;
    removed_event_chain = t->next;
    _free_event(t);
  }

#ifdef ASYNC_TCP_DEBUG
  auto end_length = _async_queue.size();
  assert(count + end_length == start_length);
  assert(_async_queue.validate_tail());

  DEBUG_PRINTF("Removed %d/%d for 0x%08x", count, start_length, (intptr_t)client);
#endif
};

static lwip_tcp_event_packet_t *_register_pcb(tcp_pcb *pcb, AsyncClient *client) {
  // do client-specific setup
  auto end_event = _alloc_event(LWIP_TCP_ERROR, client, pcb);
  if (end_event) {
    tcp_arg(pcb, client);
    tcp_recv(pcb, &AsyncClient_detail::tcp_recv);
    tcp_sent(pcb, &AsyncClient_detail::tcp_sent);
    tcp_err(pcb, &AsyncClient_detail::tcp_error);
    tcp_poll(pcb, &AsyncClient_detail::tcp_poll, CONFIG_ASYNC_TCP_POLL_TIMER);
  };
  return end_event;
}

static void _teardown_pcb(tcp_pcb *pcb) {
  assert(pcb);
  // Do teardown
  tcp_arg(pcb, NULL);
  tcp_sent(pcb, NULL);
  tcp_recv(pcb, NULL);
  tcp_err(pcb, NULL);
  tcp_poll(pcb, NULL, 0);
}

inline lwip_tcp_event_packet_t *AsyncClient_detail::invalidate_pcb(AsyncClient &client) {
  auto end_event = client._end_event;
  _teardown_pcb(client._pcb);
  client._pcb = nullptr;
  client._end_event = nullptr;
  _remove_events_for(&client);
#ifdef CONFIG_ASYNC_TCP_COALESCE_RECV
  client._recv_pending = nullptr;  // killed by _remove_events_for
#endif
  return end_event;
};

inline lwip_tcp_event_packet_t *AsyncClient_detail::get_async_event() {
  queue_mutex_guard guard;
  lwip_tcp_event_packet_t *e = _async_queue.pop_front();
  // special case: override values while holding the lock
#ifdef CONFIG_ASYNC_TCP_COALESCE_RECV
  if (e && (e->event = LWIP_TCP_RECV) & & (e->client->_recv_pending == e)) {
    e->client->_recv_pending = nullptr;
  }
#endif
  DEBUG_PRINTF("0x%08x", (intptr_t)e);
  return e;
}

void AsyncClient_detail::handle_async_event(lwip_tcp_event_packet_t *e) {
  // Special cases first
  if (e->event == LWIP_TCP_ERROR) {
    DEBUG_PRINTF("-E: 0x%08x %d", e->client, e->error.err);
    // Special case: pcb is now invalid, and will have been null'd out by the lwip thread
    if (e->client) {
      e->client->_error(e->error.err);
    }
  } else if (e->event == LWIP_TCP_DNS) {  // client has no PCB allocated yet
    DEBUG_PRINTF("-D: 0x%08x %s = %s", e->client, e->dns.name, ipaddr_ntoa(&e->dns.addr));
    e->client->_dns_found(&e->dns.addr);
  }
  // Now check for client pointer
  else if (e->client->pcb() == NULL) {
    // This can only happen if event processing is racing with closing or destruction in a third task.
    // Drop the event and do nothing.
    DEBUG_PRINTF("event client pcb == NULL: 0x%08x", e->client);
  }
#ifdef ASYNCTCP_VALIDATE_PCB
  else if (e->client.pcb() != e->pcb) {
    log_e("event client pcb mismatch: 0x%08x -> 0x%08x vs 0x%08x", e->client, e->client.pcb(), e->pcb);
  }
#endif
  // OK, process other events
  // TODO: is a switch-case more code efficient?
  else if (e->event == LWIP_TCP_RECV) {
    DEBUG_PRINTF("-R: 0x%08x", e->client->_pcb);
    e->client->_recv(e->recv.pb, e->recv.err);
    e->recv.pb = nullptr;  // Consumed by client
  } else if (e->event == LWIP_TCP_FIN) {
    DEBUG_PRINTF("-F: 0x%08x", e->client->_pcb);
    e->client->_fin(e->fin.err);
  } else if (e->event == LWIP_TCP_SENT) {
    DEBUG_PRINTF("-S: 0x%08x", e->client->_pcb);
    auto sent = e->client->_sent_pending.exchange(0);
    e->client->_sent(sent);
  } else if (e->event == LWIP_TCP_POLL) {
    DEBUG_PRINTF("-P: 0x%08x", e->client->_pcb);
    e->client->_polls_pending.store(0);
    e->client->_poll();
  } else if (e->event == LWIP_TCP_CONNECTED) {
    DEBUG_PRINTF("-C: 0x%08x 0x%08x %d", e->client, e->client->_pcb, e->connected.err);
    e->client->_connected(e->connected.err);
  } else if (e->event == LWIP_TCP_ACCEPT) {
    DEBUG_PRINTF("-A: 0x%08x 0x%08x", e->client, e->accept.server);
    e->accept.server->_accepted(e->client);
  }
  _free_event(e);
}

static void _async_service_task(void *pvParameters) {
#if CONFIG_ASYNC_TCP_USE_WDT
  if (esp_task_wdt_add(NULL) != ESP_OK) {
    log_w("Failed to add async task to WDT");
  }
#endif
  for (;;) {
    while (auto packet = AsyncClient_detail::get_async_event()) {
      AsyncClient_detail::handle_async_event(packet);
#if CONFIG_ASYNC_TCP_USE_WDT
      esp_task_wdt_reset();
#endif
    }
    // queue is empty
    // DEBUG_PRINTF("Async task waiting 0x%08",(intptr_t)_async_queue_head);
    ulTaskNotifyTake(pdTRUE, ASYNC_TCP_MAX_TASK_SLEEP);
    // DEBUG_PRINTF("Async task woke = %d 0x%08x",q, (intptr_t)_async_queue_head);
#if CONFIG_ASYNC_TCP_USE_WDT
    esp_task_wdt_reset();
#endif
  }
#if CONFIG_ASYNC_TCP_USE_WDT
  esp_task_wdt_delete(NULL);
#endif
  vTaskDelete(NULL);
  _async_service_task_handle = NULL;
}

/*
static void _stop_async_task(){
    if(_async_service_task_handle){
        vTaskDelete(_async_service_task_handle);
        _async_service_task_handle = NULL;
    }
}
*/

static bool customTaskCreateUniversal(
  TaskFunction_t pxTaskCode, const char *const pcName, const uint32_t usStackDepth, void *const pvParameters, UBaseType_t uxPriority,
  TaskHandle_t *const pxCreatedTask, const BaseType_t xCoreID
) {
#ifndef CONFIG_FREERTOS_UNICORE
  if (xCoreID >= 0 && xCoreID < 2) {
    return xTaskCreatePinnedToCore(pxTaskCode, pcName, usStackDepth, pvParameters, uxPriority, pxCreatedTask, xCoreID);
  } else {
#endif
    return xTaskCreate(pxTaskCode, pcName, usStackDepth, pvParameters, uxPriority, pxCreatedTask);
#ifndef CONFIG_FREERTOS_UNICORE
  }
#endif
}

static bool _start_async_task() {
  if (!_init_async_event_queue()) {
    return false;
  }
  if (!_async_service_task_handle) {
    customTaskCreateUniversal(
      _async_service_task, "async_tcp", CONFIG_ASYNC_TCP_STACK_SIZE, NULL, CONFIG_ASYNC_TCP_PRIORITY, &_async_service_task_handle, CONFIG_ASYNC_TCP_RUNNING_CORE
    );
    if (!_async_service_task_handle) {
      return false;
    }
  }
  return true;
}

