ESP32Async/AsyncTCP/src/AsyncTCP.cpp
/*
 * LwIP Callbacks
 * */

static int8_t _tcp_connected(void *arg, tcp_pcb *pcb, int8_t err) {
  DEBUG_PRINTF("+C: 0x%08x", pcb);
  AsyncClient *client = reinterpret_cast<AsyncClient *>(arg);
  lwip_tcp_event_packet_t *e = _alloc_event(LWIP_TCP_CONNECTED, client, pcb);
  if (e == nullptr) {
    return ERR_MEM;
  }
  e->connected.err = err;
  queue_mutex_guard guard;
  _send_async_event(e);
  return ERR_OK;
}

int8_t AsyncClient_detail::tcp_poll(void *arg, struct tcp_pcb *pcb) {
  DEBUG_PRINTF("+P: 0x%08x", pcb);
  AsyncClient *client = reinterpret_cast<AsyncClient *>(arg);

  // Coalesce event, if possible
  if (client->_polls_pending++ != 0) {
    return ERR_OK;
  }

  lwip_tcp_event_packet_t *e = _alloc_event(LWIP_TCP_POLL, client, pcb);
  if (e == nullptr) {
    return ERR_MEM;
  }

  queue_mutex_guard guard;
  _send_async_event(e);
  return ERR_OK;
}

int8_t AsyncClient_detail::tcp_recv(void *arg, struct tcp_pcb *pcb, struct pbuf *pb, int8_t err) {
  AsyncClient *client = reinterpret_cast<AsyncClient *>(arg);

  if (pb) {
    DEBUG_PRINTF("+R: 0x%08x", pcb);
    queue_mutex_guard guard;

    // Coalesce event, if possible
#ifdef CONFIG_ASYNC_TCP_COALESCE_RECV
    if ((err == 0) && (client->_recv_pending)) {
      pbuf_cat(client->_recv_pending->pb, pb);
      return ERR_OK;
    }
#endif

    lwip_tcp_event_packet_t *e = _alloc_event(LWIP_TCP_RECV, client, pcb);
    if (e == nullptr) {
      pbuf_free(pb);
      return ERR_MEM;  // TODO - error handling???
    }

    e->recv.pb = pb;
    e->recv.err = err;
#ifdef CONFIG_ASYNC_TCP_COALESCE_RECV
    if (err == 0) {
      client->_recv_pending = e;
    } else {
      // if we had one, we can no longer extend it
      client->_recv_pending = nullptr;
    }
#endif

    _send_async_event(e);
  } else {
    DEBUG_PRINTF("+F: 0x%08x -> 0x%08x", pcb, arg);
    queue_mutex_guard guard;
    lwip_tcp_event_packet_t *e = _alloc_event(LWIP_TCP_FIN, client, pcb);
    if (e == nullptr) {
      return ERR_MEM;
    }

    e->fin.err = err;
    _send_async_event(e);
  }

  return ERR_OK;
}

int8_t AsyncClient_detail::tcp_sent(void *arg, struct tcp_pcb *pcb, uint16_t len) {
  DEBUG_PRINTF("+S: 0x%08x", pcb);
  AsyncClient *client = reinterpret_cast<AsyncClient *>(arg);

  // Coalesce event, if possible
  auto _prev_pending = client->_sent_pending.fetch_add(len);
  if (_prev_pending) return ERR_OK;

  lwip_tcp_event_packet_t *e = _alloc_event(LWIP_TCP_SENT, client, pcb);
  if (e == nullptr) {
    return ERR_MEM;
  }

  queue_mutex_guard guard;
  _send_async_event(e);
  return ERR_OK;
}

void AsyncClient_detail::tcp_error(void *arg, int8_t err) {
  DEBUG_PRINTF("+E: 0x%08x %d", arg, err);
  AsyncClient *client = reinterpret_cast<AsyncClient *>(arg);
  assert(client);
  // The associated pcb is now invalid and will soon be deallocated
  // We call on the preallocated end event from the client object
  queue_mutex_guard guard;
  lwip_tcp_event_packet_t *e = AsyncClient_detail::invalidate_pcb(*client);
  if (e) {
    e->error.err = err;
    _prepend_async_event(e);
  } else {
    log_e("tcp_error call for client %X with no end event", (intptr_t)client);
  }
}

static void _tcp_dns_found(const char *name, struct ip_addr *ipaddr, void *arg) {
  DEBUG_PRINTF("+DNS: name=%s ipaddr=0x%08x arg=%x", name, ipaddr, arg);
  auto client = reinterpret_cast<AsyncClient *>(arg);
  lwip_tcp_event_packet_t *e = _alloc_event(LWIP_TCP_DNS, client, client->pcb());
  if (e != nullptr) {
    e->dns.name = name;
    if (ipaddr) {
      memcpy(&e->dns.addr, ipaddr, sizeof(struct ip_addr));
    } else {
      memset(&e->dns.addr, 0, sizeof(e->dns.addr));
    }

    queue_mutex_guard guard;
    _send_async_event(e);
  }
}

// Runs on LWIP thread
static int8_t _tcp_accept(AsyncServer *server, AsyncClient *client) {
  lwip_tcp_event_packet_t *e = _alloc_event(LWIP_TCP_ACCEPT, client, client->pcb());
  if (e == nullptr) {
    return ERR_MEM;
  }
  e->accept.server = server;

  queue_mutex_guard guard;
  _send_async_event(e);
  return ERR_OK;
}

/*
 * TCP/IP API Calls
 * */

#include "lwip/priv/tcpip_priv.h"

typedef struct {
  struct tcpip_api_call_data call;
  tcp_pcb **pcb_ptr;  // double indirection to manage races with client threads
  int8_t err;
  union {
    struct {
      const char *data;
      size_t size;
      uint8_t apiflags;
    } write;
    size_t received;
    struct {
      const ip_addr_t *addr;
      uint16_t port;
      tcp_connected_fn cb;
    } connect;
    struct {
      ip_addr_t *addr;
      uint16_t port;
    } bind;
    AsyncClient *client;  // used for close() and abort()
    uint8_t backlog;
  };
} tcp_api_call_t;

// Given the multithreaded nature of this code, it's possible that pcb has
// been invalidated by the stack thread, but the client thread doesn't know
// yet.  Before performing any operation on a pcb, check to make sure we
// are still tracking it.
// AsyncClient guarantees that the _pcb member can only be overwritten by
// the LwIP thread.
static inline bool pcb_is_active(tcp_api_call_t &p) {
  return (p.pcb_ptr) && (*p.pcb_ptr);
}

static err_t _tcp_output_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = ERR_CONN;
  if (pcb_is_active(*msg)) {
    msg->err = tcp_output(*msg->pcb_ptr);
  }
  return msg->err;
}

static err_t _tcp_write_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = ERR_CONN;
  if (pcb_is_active(*msg)) {
    msg->err = tcp_write(*msg->pcb_ptr, msg->write.data, msg->write.size, msg->write.apiflags);
  }
  return msg->err;
}

static err_t _tcp_recved_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = ERR_CONN;
  if (pcb_is_active(*msg)) {
    msg->err = 0;
    tcp_recved(*msg->pcb_ptr, msg->received);
  }
  return msg->err;
}

// Unlike LwIP's tcp_close, we don't permit failure
// If the pcb can't be closed cleanly, we abort it.
static err_t _tcp_close_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = ERR_CONN;
  if (pcb_is_active(*msg)) {
    auto pcb = *msg->pcb_ptr;
    if (msg->client) {
      // Client has requested close; complete teardown
      queue_mutex_guard guard;
      _free_event(AsyncClient_detail::invalidate_pcb(*msg->client));
    }
    msg->err = tcp_close(pcb);
    if (msg->err != ERR_OK) {
      tcp_abort(pcb);
    }
    *msg->pcb_ptr = nullptr;
  }
  return msg->err;
}

// Sets *pcb_ptr to nullptr
static esp_err_t _tcp_close(tcp_pcb **pcb_ptr, AsyncClient *client) {
  if (!pcb_ptr || !*pcb_ptr) {
    return ERR_CONN;
  }
  tcp_api_call_t msg;
  msg.pcb_ptr = pcb_ptr;
  msg.client = client;
  tcpip_api_call(_tcp_close_api, (struct tcpip_api_call_data *)&msg);
  return msg.err;
}

static err_t _tcp_abort_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = ERR_CONN;
  {
    queue_mutex_guard guard;
    _remove_events_for(msg->client);
  }
  if (pcb_is_active(*msg)) {
    _teardown_pcb(*msg->pcb_ptr);
    tcp_abort(*msg->pcb_ptr);
    *msg->pcb_ptr = nullptr;
  }
  return msg->err;
}

// Sets *pcb_ptr to nullptr
static esp_err_t _tcp_abort(tcp_pcb **pcb_ptr, AsyncClient *client) {
  if (!pcb_ptr || !*pcb_ptr) {
    return ERR_CONN;
  }
  tcp_api_call_t msg;
  msg.pcb_ptr = pcb_ptr;
  msg.client = client;
  tcpip_api_call(_tcp_abort_api, (struct tcpip_api_call_data *)&msg);
  assert(*pcb_ptr == nullptr);  // must be true
  return msg.err;
}

static err_t _tcp_connect_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = tcp_connect(*msg->pcb_ptr, msg->connect.addr, msg->connect.port, msg->connect.cb);
  return msg->err;
}

static err_t _tcp_bind_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = tcp_bind(*msg->pcb_ptr, msg->bind.addr, msg->bind.port);
  return msg->err;
}

static esp_err_t _tcp_bind(tcp_pcb *pcb, ip_addr_t *addr, uint16_t port) {
  if (!pcb) {
    return ESP_FAIL;
  }
  tcp_api_call_t msg;
  msg.pcb_ptr = &pcb;
  msg.bind.addr = addr;
  msg.bind.port = port;
  tcpip_api_call(_tcp_bind_api, (struct tcpip_api_call_data *)&msg);
  return msg.err;
}

static err_t _tcp_listen_api(struct tcpip_api_call_data *api_call_msg) {
  tcp_api_call_t *msg = (tcp_api_call_t *)api_call_msg;
  msg->err = 0;
  *msg->pcb_ptr = tcp_listen_with_backlog(*msg->pcb_ptr, msg->backlog);
  return msg->err;
}

static tcp_pcb *_tcp_listen_with_backlog(tcp_pcb *pcb, uint8_t backlog) {
  if (!pcb) {
    return NULL;
  }
  tcp_api_call_t msg;
  msg.pcb_ptr = &pcb;
  msg.backlog = backlog ? backlog : 0xFF;
  tcpip_api_call(_tcp_listen_api, (struct tcpip_api_call_data *)&msg);
  return pcb;
}

