ESP32Async/AsyncTCP/src/AsyncTCP.cpp
/*
  Async TCP Client
 */

AsyncClient::AsyncClient(tcp_pcb *pcb)
  : _pcb(pcb), _end_event(nullptr), _needs_discard(pcb != nullptr), _polls_pending(0), _sent_pending(0),
#ifdef CONFIG_ASYNC_TCP_COALESCE_RECV
    _recv_pending(nullptr),
#endif
    _connect_cb(0), _connect_cb_arg(0), _discard_cb(0), _discard_cb_arg(0), _sent_cb(0), _sent_cb_arg(0), _error_cb(0), _error_cb_arg(0), _recv_cb(0),
    _recv_cb_arg(0), _pb_cb(0), _pb_cb_arg(0), _timeout_cb(0), _timeout_cb_arg(0), _ack_pcb(true), _tx_last_packet(0), _rx_timeout(0), _rx_last_ack(0),
    _ack_timeout(CONFIG_ASYNC_TCP_MAX_ACK_TIME), _connect_port(0) {
  if (_pcb) {
    tcp_core_guard tg;
    _end_event = _register_pcb(_pcb, this);
    _rx_last_packet = millis();
    if (!_end_event) {
      // Out of memory!!
      log_e("Unable to allocate error event");
      // Swallow this PCB, producing a null client object
      tcp_abort(_pcb);
      _pcb = nullptr;
      _needs_discard = false;
    }
  }
  DEBUG_PRINTF("+AC: 0x%08x -> 0x%08x [0x%08x]", _pcb, (intptr_t)this, (intptr_t)_end_event);
}

AsyncClient::~AsyncClient() {
  DEBUG_PRINTF("-AC: 0x%08x -> 0x%08x [0x%08x]", _pcb, (intptr_t)this, (intptr_t)_end_event);
  if (_pcb) {
    _close();
  }
  assert(!_end_event);  // should have been cleaned up by _close
#ifdef CONFIG_ASYNC_TCP_COALESCE_RECV
  assert(!_recv_pending);
#endif
  assert(_needs_discard == false);  // If we needed the discard callback, it must have been called by now
                                    // We take care to clear this flag before calling the discard callback
                                    // as the discard callback commonly destructs the AsyncClient object.
}

/*
 * Callback Setters
 * */

void AsyncClient::onConnect(AcConnectHandler cb, void *arg) {
  _connect_cb = cb;
  _connect_cb_arg = arg;
}

void AsyncClient::onDisconnect(AcConnectHandler cb, void *arg) {
  _discard_cb = cb;
  _discard_cb_arg = arg;
}

void AsyncClient::onAck(AcAckHandler cb, void *arg) {
  _sent_cb = cb;
  _sent_cb_arg = arg;
}

void AsyncClient::onError(AcErrorHandler cb, void *arg) {
  _error_cb = cb;
  _error_cb_arg = arg;
}

void AsyncClient::onData(AcDataHandler cb, void *arg) {
  _recv_cb = cb;
  _recv_cb_arg = arg;
}

void AsyncClient::onPacket(AcPacketHandler cb, void *arg) {
  _pb_cb = cb;
  _pb_cb_arg = arg;
}

void AsyncClient::onTimeout(AcTimeoutHandler cb, void *arg) {
  _timeout_cb = cb;
  _timeout_cb_arg = arg;
}

void AsyncClient::onPoll(AcConnectHandler cb, void *arg) {
  _poll_cb = cb;
  _poll_cb_arg = arg;
}

/*
 * Main Public Methods
 * */

bool AsyncClient::_connect(const ip_addr_t &addr, uint16_t port) {
  if (_pcb) {
    log_d("already connected, state %d", _pcb->state);
    return false;
  }
  if (!_start_async_task()) {
    log_e("failed to start task");
    return false;
  }

  {
    tcp_core_guard tg;
    _pcb = tcp_new_ip_type(addr.type);
    if (!_pcb) {
      log_e("pcb == NULL");
      return false;
    }
    _end_event = _register_pcb(_pcb, this);

    if (!_end_event) {
      log_e("Unable to allocate event");
      tcp_abort(_pcb);
      _pcb = nullptr;
      return false;
    }
    _needs_discard = true;
  }

  tcp_api_call_t msg;
  msg.pcb_ptr = &_pcb;
  msg.connect.addr = &addr;
  msg.connect.port = port;
  msg.connect.cb = (tcp_connected_fn)&_tcp_connected;
  tcpip_api_call(_tcp_connect_api, (struct tcpip_api_call_data *)&msg);
  return msg.err == ESP_OK;
}

bool AsyncClient::connect(const IPAddress &ip, uint16_t port) {
  ip_addr_t addr;
#if ESP_IDF_VERSION_MAJOR < 5
  addr.u_addr.ip4.addr = ip;
  addr.type = IPADDR_TYPE_V4;
#else
  ip.to_ip_addr_t(&addr);
#endif

  return _connect(addr, port);
}

#if LWIP_IPV6 && ESP_IDF_VERSION_MAJOR < 5
bool AsyncClient::connect(const IPv6Address &ip, uint16_t port) {
  auto ipaddr = static_cast<const uint32_t *>(ip);
  ip_addr_t addr = IPADDR6_INIT(ipaddr[0], ipaddr[1], ipaddr[2], ipaddr[3]);

  return _connect(addr, port);
}
#endif

bool AsyncClient::connect(const char *host, uint16_t port) {
  ip_addr_t addr;

  if (!_start_async_task()) {
    log_e("failed to start task");
    return false;
  }

  err_t err;
  {
    tcp_core_guard tg;
    err = dns_gethostbyname(host, &addr, (dns_found_callback)&_tcp_dns_found, this);
  }

  if (err == ERR_OK) {
#if ESP_IDF_VERSION_MAJOR < 5
#if LWIP_IPV6
    if (addr.type == IPADDR_TYPE_V6) {
      return connect(IPv6Address(addr.u_addr.ip6.addr), port);
    }
    return connect(IPAddress(addr.u_addr.ip4.addr), port);
#else
    return connect(IPAddress(addr.addr), port);
#endif
#else
    return _connect(addr, port);
#endif
  } else if (err == ERR_INPROGRESS) {
    _connect_port = port;
    return true;
  }
  log_d("error: %d", err);
  return false;
}

void AsyncClient::close(bool now) {
  if (_pcb) {
    _recved(_rx_ack_len);
  }
  _close();
}

int8_t AsyncClient::abort() {
  if (_pcb) {
    _tcp_abort(&_pcb, this);
    _needs_discard = false;
  }
  return ERR_ABRT;
}

size_t AsyncClient::space() {
  if ((_pcb != NULL) && (_pcb->state == ESTABLISHED)) {
    return tcp_sndbuf(_pcb);
  }
  return 0;
}

size_t AsyncClient::add(const char *data, size_t size, uint8_t apiflags) {
  if (!_pcb || size == 0 || data == NULL) {
    return 0;
  }
  size_t room = space();
  if (!room) {
    return 0;
  }
  tcp_api_call_t msg;
  msg.pcb_ptr = &_pcb;
  msg.err = ERR_OK;
  msg.write.data = data;
  msg.write.size = std::min(room, size);
  msg.write.apiflags = apiflags;
  tcpip_api_call(_tcp_write_api, (struct tcpip_api_call_data *)&msg);
  if (msg.err != ERR_OK) {
    return 0;
  }
  return msg.write.size;
}

bool AsyncClient::send() {
  auto backup = _tx_last_packet;
  _tx_last_packet = millis();
  if (!_pcb) {
    return false;
  }
  tcp_api_call_t msg;
  msg.pcb_ptr = &_pcb;
  tcpip_api_call(_tcp_output_api, (struct tcpip_api_call_data *)&msg);
  if (msg.err == ERR_OK) {
    return true;
  }
  _tx_last_packet = backup;
  return false;
}

size_t AsyncClient::ack(size_t len) {
  if (len > _rx_ack_len) {
    len = _rx_ack_len;
  }
  if (len) {
    _recved(len);
  }
  _rx_ack_len -= len;
  return len;
}

